Repository: OSGeo-jp/OSGeoLive-doc-omegat
Catalog: tm/quickstart--spatialite_quickstart.tmx
Source language: en
Languages: ja

source: SpatiaLite Quickstart
ja: Spatialiteクイックスタート

source: SpatiaLite is an SQLite database engine with spatial functions added.
ja: SpatiaLite は空間を扱う関数を追加した SQLite データベースエンジンです。

source: SQLite is a Database Management System (DBMS) which is simple, robust, easy to use and very lightweight. Each SQLite database is simply a file. You can freely copy it, compress it, and port it between Windows, Linux, MacOs etc.
ja: SQLite は動作が軽く、シンプルで堅牢、簡単に使える人気のあるデータベース管理システム (DBMS) です。それぞれのデータベースは一つのファイルに格納されます。コピー、圧縮や、Windows、Linux、MacOS などのOS間の移行も簡単にできます。

source: This Quick Start describes how to open a spatialite database from both GUI applications and the command line. Some sample SQL queries are shown.
ja: このクイックスタートでは、GUIアプリケーションとコマンドラインの両方からspatialiteデータベースを開く方法について説明します。いくつかのサンプルSQLクエリも示します。

source: Start Spatialite and load a database
ja: Spatialiteを起動してデータベースを読み込む

source: Spatialite-gui provides a visual interface for viewing and maintaining a spatialite database. You can easily see the structure of the tables and data contents using point and click functions, many of which construct common SQL queries, or craft your own SQL queries.
ja: Spatialite-guiは、spatialiteデータベースを表示および維持するためのビジュアルインターフェイスを提供します。ポイント・アンド・クリック機能を使用すると、テーブルとデータコンテンツの構造を簡単に確認できます。その多くは一般的なSQLクエリーを構築したり、独自のSQLクエリーを作成したりします。

source: Open the Spatialite GUI by selecting :menuselection:`Geospatial->Databases->Spatialite GUI`.
ja: :menuselection:`Geospatial->Databases->Spatialite GUI`を選択して、Spatialite GUIを開きます。

source: Select :menuselection:`File->Connecting an existing SQLite DB`
ja: :menuselection:`File->Connecting an existing SQLite DB`を選択します。

source: Browse to the :file:`/home/user/data/spatialite` directory and choose :file:`trento.sqlite`.
ja: :file:`/home/user/data/spatialite`ディレクトリにブラウズし、:file:`trento.sqlite`を選択します。

source: Right click on the MunicipalHallsView table and select "Show Columns"
ja: MunicipalHallsViewテーブルを右クリックして、"Show Columns"を選択します。

source: You will notice the display broken into 3 areas:
ja: 表示が3つの領域に分割されていることがわかります。

source: The left panel displays the database hierarchy, such as a list of tables, and columns within the table. Right click on elements of the left panel to select from a list of common database actions.
ja: 左側のパネルには、テーブルのリストやテーブル内のカラムなど、データベースの階層が表示されます。左側のパネルの要素を右クリックして、一般的なデータベースアクションのリストから選択します。

source: The top right panel shows SQL for the action selected. You can enter your own customised SQL into this panel.
ja: 右上のパネルには、選択したアクションのSQLが表示されます。このパネルには、独自にカスタマイズしたSQLを入力できます。

source: The bottom right panel shows the results of the SQL query.
ja: 右下のパネルには、SQLクエリの結果が表示されます。

source: Right Click on the MunicipalHalls table and select "Edit table rows". Notice the SQL query which has been created for you in the top right pane, and results in the bottom right.::
ja: MunicipalHallsテーブルを右クリックして、"Edit table rows"を選択します。右上のペインに作成されたSQLクエリが表示され、結果が右下に表示されます。::

source: Run an SQL query
ja: SQLクエリを実行する

source: Now let's try tweaking this SQL statement to get NOME and (Lat,Long) for only the NOME_PROV fields include "BRESCIA", this time using the MunicipalHallsView. In the upper right SQL pane type::
ja: 次に、このSQL文を調整して、NOME_PROVフィールドだけのNOMEと(Lat,Long)を取得してみましょう。NOME_PROVフィールドには"BRESCIA"が含まれます。今度はMunicipalHallsViewを使用します。右上のSQLペインで、次のように入力します::

source: Click the "Execute SQL" button at the right, and see the results in the bottom right pane.
ja: 右側の"Execute SQL"ボタンをクリックすると、右下のペインに結果が表示されます。

source: Run spatialite from the command line
ja: コマンドラインからspatialiteを実行する

source: Users needing to script or automate queries will learn the advantages of working with a spatialite database from the command line interface. In this example, we will load a shapefile, and search for schools which are near highway 42.
ja: スクリプトを使用したりクエリを自動化したりする必要があるユーザは、コマンドラインインターフェイスからspatialiteデータベースを操作する利点を学習します。この例では、シェイプファイルをロードし、highway 42の近くにある学校を検索します。

source: Before working from the command line, we need to open a terminal window: :menuselection:`LXDE Menu -> Accessories -> LXTerminal`.
ja: コマンドラインから作業する前に、ターミナルウィンドウ::menuselection:`システムツール->LXTerminal`を開いてください。

source: In the terminal open a sample database with **spatialite** by typing::
ja: ターミナルで、次のように入力して**spatialite**でサンプルデータベースを開きます::

source: Helpful commands from the command line::
ja: コマンドラインからの便利なコマンド::

source: Create a new spatialite database and load a shapefile
ja: 新しいspatialiteデータベースを作成し、シェープファイルを読み込む

source: Let's create a new, empty spatialite database, and load two shapefiles from the north_carolina dataset::
ja: 新しい空のspatialiteデータベースを作成し、north_carolinaデータセットから2つのシェープファイルをロードしてみましょう::

source: Note the format of the .loadshp command: first the shapefile without the .shp extension, then the name of the new spatialite table, next the character encoding, and finally the EPSG code of the shapefile's CRS.
ja: loadshpコマンドの形式に注意してください: 最初は.shp拡張子のないシェープファイル、次に新しいspatialiteテーブルの名前、次に文字コード、最後にシェープファイルのCRSのEPSGコードです。

source: Now we'll query for schools near to highway 42.::
ja: 次に、ハイウェイ42に近い学校を検索します::

source: Finally, we output the query to a "comma separated values" text file "schools_rt42.txt" with the following commands::
ja: 最後に、次のコマンドを使用して、クエリを"comma separated values"テキストファイル"schools_rt42.txt"に出力します::

source: Things to try
ja: 試してみること

source: Here are some additional challenges for you to try:
ja: 次に、試すべき追加の課題をいくつか示します。

source: Inspect geometries with spatialite-gui
ja: spatialite-guiを使用してジオメトリを検査する

source: Open and edit SpatiaLite layers in QGIS
ja: QGISでSpatialiteレイヤを開いて編集する

source: What next?
ja: 次のステップ

source: To learn more about SpatiaLite, a starting point is the `SpatiaLite project page`_.
ja: Spatialiteの詳細については、`Spatialite project page`_を参照してください。

source: Be sure to visit the tutorial `Spatialite cookbook`_
ja: チュートリアル`Spatialite cookbook`_を必ず参照してください。
